---
kind: method
id: M:Autodesk.Revit.DB.SharedParameterApplicableRule.#ctor(System.String)
source: html/3bca4d88-f5df-a42a-7a75-87bf173c2ac7.htm
---
# Autodesk.Revit.DB.SharedParameterApplicableRule.#ctor Method

Constructs an instance of SharedParameterApplicableRule.

## Syntax (C#)
```csharp
public SharedParameterApplicableRule(
	string parameterName
)
```

## Parameters
- **parameterName** (`System.String`) - The name of the parameter that an element must support to pass this rule.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null